// Вивести на екран всі числа від 1 до 10 за допомогою циклу while.

// console.log("Assignment 1: ");
// let i = 1; 
// while (i<=10) {
//     console.log(i);
//     i++;
// }

// Вивести на екран всі парні числа від 2 до 20 за допомогою циклу for.
//Якщо число не парне, пропустити його за допомогою continue.

// console.log("Assignment 2: ");
// for (let v = 2; v <= 20; v++) {
//     if(v%2 == 0)
//         continue
//     else 
//         console.log(v);    
// }

// Вивести на екран таблицю множення числа 7 за допомогою циклу for.

// console.log("Assignment 3: ");
// for (let a = 0; a < 13; a++) {
//     console.log(a*7);
// }

// Створити масив з числами від 1 до 5. Вивести на екран кожен елемент масиву за допомогою циклу while.

// console.log("Assignment 4: ");
// let array = [1, 2, 3, 4, 5]; 
// let count = 0; 
// while (count < 5) {
//     console.log(array[count]);
//     count++; 
// }

// Створити масив із числами від 1 до 10. За допомогою циклу for пройтися по масиву та вивести на екран
//всі числа, крім числа 7. Якщо зустрінете число 7, закінчити виконання циклу за допомогою оператора break.

// console.log("Assignment 5: ");
// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]; 
// for (let b = 0; b < 11; b++) {
//     if (arr[b] == 7)
//         break;
//     else
//         console.log(arr[b]);
// }

// Створити скрипт, який виводить на екран всі числа, які менші за n. Якщо зустрічається число, що більше
//або дорівнює n, цикл повинен бути закінчений за допомогою break.

// console.log("Assignment 6: ");
// let n = 10; 
// let num = 1; 
// while (true) {
//     if (num >= n) {
//         break;
//     }
//     else 
//         console.log(num);
//     num++;
// }

// За допомогою циклу while вивести на екран всі числа від 1 до 20, крім чисел, кратних 3.
//Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання за допомогою оператора continue.

// console.log("Assignment 7: ");

// for (let r = 1; r < 21; r++) {
//     if (r % 3 == 0)
//         continue
//     else
//         console.log(r);
// }
//let c = 1; 
// while (c < 21) {
//     if (c % 3 == 0) {
//         continue;
//     }
//     else {
//         console.log(c);
//     }
//     c++;
// }